app/Http/Controllers/DepartmentController.php

select * from `department`
---
    public function index()
    {
        // Get all department records from database
        $departments = Department::all();

select * from `department` where `department`.`department_id` = 'BF' limit 1
---
    public function update(Request $request, $id)
    {
        // Validate input
        $request->validate([
            'department_id' => 'required|string|max:5|unique:department,department_id,' . $id . ',department_id',
            'name' => 'required|string|max:100'
        ]);

        // Find and update record
        $department = Department::findOrFail($id);