app/Http/Controllers/EmployeeController.php

select * from `employee`
---
    public function index()
    {
        // Load all employees with their related department info
        $employees = Employee::with('department')->get();

select * from `department` where `department`.`department_id` in ('BF', 'BHR', 'BP', 'BPO', 'BTM')
---
    public function create()
    {
        // Get all departments for dropdown selection
        $departments = Department::all();